# ChatGPT pandas Merge, Join, Concat and Append

## ðŸ“Š Exercise 1: Simple inner merge

Instruction:

Merge transactions and customers tables to get a table with customer names and transaction amounts, keeping only transactions where the customer exists in both tables.

Data:

In [1]:
import pandas as pd

customers = pd.DataFrame({
    "customer_id": [1,2,3],
    "customer_name": ["Alice","Bob","Charlie"]
})

transactions = pd.DataFrame({
    "transaction_id": [101,102,201,301],
    "customer_id": [1,2,2,4],
    "amount": [200,150,300,400]
})

In [2]:
customers

   customer_id customer_name
0            1         Alice
1            2           Bob
2            3       Charlie

In [3]:
transactions

   transaction_id  customer_id  amount
0             101            1     200
1             102            2     150
2             201            2     300
3             301            4     400

In [9]:
new_table = customers.merge(transactions, on='customer_id', how='left')
new_table

   customer_id customer_name  transaction_id  amount
0            1         Alice           101.0   200.0
1            2           Bob           102.0   150.0
2            2           Bob           201.0   300.0
3            3       Charlie             NaN     NaN

Exercise 1 solution

In [7]:
result = pd.merge(transactions, customers, on="customer_id", how="inner")
result

   transaction_id  customer_id  amount customer_name
0             101            1     200         Alice
1             102            2     150           Bob
2             201            2     300           Bob

## ðŸ“Š Exercise 2: Left join to keep all transactions

Instruction:

Merge transactions with customers to keep all transactions, filling missing customer names with NaN.

In [14]:
new_table = pd.merge(customers, transactions, on='customer_id', how='left')
new_table

   customer_id customer_name  transaction_id  amount
0            1         Alice           101.0   200.0
1            2           Bob           102.0   150.0
2            2           Bob           201.0   300.0
3            3       Charlie             NaN     NaN

Exercise 2 solution

In [13]:
result = pd.merge(transactions, customers, on="customer_id", how="left")
result

   transaction_id  customer_id  amount customer_name
0             101            1     200         Alice
1             102            2     150           Bob
2             201            2     300           Bob
3             301            4     400           NaN

## ðŸ“Š Exercise 3: Concatenating multiple DataFrames

Instruction:

Combine three regional transaction DataFrames into one DataFrame.

Data:

In [15]:
region1 = pd.DataFrame({"customer_id":[1,2], "amount":[100,200]})
region2 = pd.DataFrame({"customer_id":[3,4], "amount":[300,400]})
region3 = pd.DataFrame({"customer_id":[5], "amount":[500]})

In [16]:
region1

   customer_id  amount
0            1     100
1            2     200

In [17]:
region2

   customer_id  amount
0            3     300
1            4     400

In [18]:
region3

   customer_id  amount
0            5     500

In [20]:
all_regions = pd.concat([region1, region2, region3]).reset_index()
all_regions

   index  customer_id  amount
0      0            1     100
1      1            2     200
2      0            3     300
3      1            4     400
4      0            5     500

Exercise 3 solution

In [22]:
combined = pd.concat([region1, region2, region3], ignore_index=True)
combined

   customer_id  amount
0            1     100
1            2     200
2            3     300
3            4     400
4            5     500

## ðŸ“Š Exercise 4: Merge with multiple keys

Instruction:

Merge transactions with accounts using both customer_id and account_id as keys.

Data:

In [29]:
transactions = pd.DataFrame({
    "transaction_id":[101,102,201],
    "customer_id":[1,2,2],
    "account_id":[10,20,21],
    "amount":[200,150,300]
})

accounts = pd.DataFrame({
    "customer_id":[1,2,2],
    "account_id":[10,20,22],
    "account_type":["Checking","Savings","Checking"]
})

In [30]:
transactions

   transaction_id  customer_id  account_id  amount
0             101            1          10     200
1             102            2          20     150
2             201            2          21     300

In [31]:
accounts

   customer_id  account_id account_type
0            1          10     Checking
1            2          20      Savings
2            2          22     Checking

In [36]:
new_data = pd.merge(transactions, accounts, on=['customer_id', 'account_id'], how="inner")
new_data

   transaction_id  customer_id  account_id  amount account_type
0             101            1          10     200     Checking
1             102            2          20     150      Savings

Exercise 4 solution

In [38]:
result = pd.merge(transactions, accounts, on=["customer_id","account_id"], how="inner")
result

   transaction_id  customer_id  account_id  amount account_type
0             101            1          10     200     Checking
1             102            2          20     150      Savings

## Exercise 5: Merge Transactions with Risk Scores
Instruction

You have two datasets: customer transactions and customer risk ratings. Merge them so each transaction includes the customerâ€™s risk rating. If a customer has no risk rating, mark it as NaN.

Raw Data

In [1]:
import pandas as pd

transactions = pd.DataFrame({
    "customer_id": ["C1", "C2", "C3"],
    "txn_id": ["T1", "T2", "T3"],
    "amount": [500, 3000, 1500],
    "date": ["2025-01-10", "2025-01-12", "2025-01-13"]
})

risk_scores = pd.DataFrame({
    "customer_id": ["C1", "C2", "C4"],
    "risk_rating": ["High", "Medium", "Low"]
})

In [2]:
transactions

  customer_id txn_id  amount        date
0          C1     T1     500  2025-01-10
1          C2     T2    3000  2025-01-12
2          C3     T3    1500  2025-01-13

In [3]:
risk_scores

  customer_id risk_rating
0          C1        High
1          C2      Medium
2          C4         Low

In [6]:
result = pd.merge(transactions, risk_scores, on="customer_id", how="left")
result

  customer_id txn_id  amount        date risk_rating
0          C1     T1     500  2025-01-10        High
1          C2     T2    3000  2025-01-12      Medium
2          C3     T3    1500  2025-01-13         NaN

Exercise 5 solution

In [8]:
merged = transactions.merge(risk_scores, on="customer_id", how="left")
merged

  customer_id txn_id  amount        date risk_rating
0          C1     T1     500  2025-01-10        High
1          C2     T2    3000  2025-01-12      Medium
2          C3     T3    1500  2025-01-13         NaN

## Exercise 6: Concatenate AML Alerts
Instruction

You receive AML alerts quarterly in separate files. Concatenate Q1, Q2, and Q3 into a single DataFrame.

Raw Data

In [9]:
q1_alerts = pd.DataFrame({
    "alert_id": ["A1"],
    "customer_id": ["C1"],
    "alert_type": ["Structuring"]
})

q2_alerts = pd.DataFrame({
    "alert_id": ["A2"],
    "customer_id": ["C2"],
    "alert_type": ["Sanctions"]
})

q3_alerts = pd.DataFrame({
    "alert_id": ["A3"],
    "customer_id": ["C1"],
    "alert_type": ["High Cash"]
})

In [10]:
q1_alerts

  alert_id customer_id   alert_type
0       A1          C1  Structuring

In [11]:
q2_alerts

  alert_id customer_id alert_type
0       A2          C2  Sanctions

In [12]:
q3_alerts

  alert_id customer_id alert_type
0       A3          C1  High Cash

In [15]:
concat = pd.concat([q1_alerts, q2_alerts, q3_alerts], ignore_index=True)
concat

  alert_id customer_id   alert_type
0       A1          C1  Structuring
1       A2          C2    Sanctions
2       A3          C1    High Cash

Exercise 6 solution

In [16]:
all_alerts = pd.concat([q1_alerts, q2_alerts, q3_alerts], ignore_index=True)
all_alerts

  alert_id customer_id   alert_type
0       A1          C1  Structuring
1       A2          C2    Sanctions
2       A3          C1    High Cash

## Exercise 7: Join Suspicious Account Labels
Instruction

Join suspicious account flags to transactions so you can filter only suspicious transactions. Use join instead of merge.

Raw Data

In [17]:
transactions = pd.DataFrame({
    "txn_id": ["T1", "T2", "T3"],
    "customer_id": ["C1", "C2", "C3"],
    "amount": [2000, 500, 7000]
}).set_index("customer_id")

suspicious_accounts = pd.DataFrame({
    "customer_id": ["C1", "C3"],
    "is_suspicious": ["Yes", "Yes"]
}).set_index("customer_id")

In [18]:
transactions

            txn_id  amount
customer_id
C1              T1    2000
C2              T2     500
C3              T3    7000

In [19]:
suspicious_accounts

            is_suspicious
customer_id
C1                    Yes
C3                    Yes

Exercise 7 solution

In [20]:
joined = transactions.join(suspicious_accounts, how="left")
joined

            txn_id  amount is_suspicious
customer_id
C1              T1    2000           Yes
C2              T2     500           NaN
C3              T3    7000           Yes

## Exercise 8: Merge Wire Transfers with Sanctions List
Instruction

You need to check if any wire transfer involves sanctioned entities (sender or receiver). Merge wire transfers with sanctions list twice (once for sender, once for receiver).

Raw Data

In [21]:
wires = pd.DataFrame({
    "txn_id": ["W1", "W2", "W3"],
    "sender": ["C1", "C3", "C5"],
    "receiver": ["C2", "C4", "C6"],
    "amount": [1000, 8000, 2000]
})

sanctions = pd.DataFrame({
    "entity": ["C4", "C7"]
})

In [22]:
wires

  txn_id sender receiver  amount
0     W1     C1       C2    1000
1     W2     C3       C4    8000
2     W3     C5       C6    2000

In [23]:
sanctions

  entity
0     C4
1     C7

In [24]:
sender = pd.merge(wires, sanctions, on="sender")

KeyError: 'sender'

Solution

In [25]:
sender_check = wires.merge(sanctions, left_on="sender", right_on="entity", how="left", indicator="sender_flag")
receiver_check = wires.merge(sanctions, left_on="receiver", right_on="entity", how="left", indicator="receiver_flag")

print(sender_check)
print(receiver_check)

  txn_id sender receiver  amount entity sender_flag
0     W1     C1       C2    1000    NaN   left_only
1     W2     C3       C4    8000    NaN   left_only
2     W3     C5       C6    2000    NaN   left_only
  txn_id sender receiver  amount entity receiver_flag
0     W1     C1       C2    1000    NaN     left_only
1     W2     C3       C4    8000     C4          both
2     W3     C5       C6    2000    NaN     left_only

In [26]:
sender_check = pd.merge(wires, sanctions, left_on="sender", right_on="entity", how="left", indicator="sender_flag")
sender_check

  txn_id sender receiver  amount entity sender_flag
0     W1     C1       C2    1000    NaN   left_only
1     W2     C3       C4    8000    NaN   left_only
2     W3     C5       C6    2000    NaN   left_only

## Exercise 9: Combine KYC Records
Instruction

You have KYC records from two systems. Combine them into one DataFrame, keeping the latest record per customer based on last_update.

Raw Data

In [27]:
kyc_sys1 = pd.DataFrame({
    "customer_id": ["C1", "C2"],
    "address": ["Addr1", "Addr2"],
    "last_update": ["2025-01-10", "2025-01-05"]
})

kyc_sys2 = pd.DataFrame({
    "customer_id": ["C1", "C3"],
    "address": ["Addr3", "Addr4"],
    "last_update": ["2025-01-15", "2025-01-07"]
})

In [28]:
kyc_sys1

  customer_id address last_update
0          C1   Addr1  2025-01-10
1          C2   Addr2  2025-01-05

In [29]:
kyc_sys2

  customer_id address last_update
0          C1   Addr3  2025-01-15
1          C3   Addr4  2025-01-07